{
    "sections": [
      {
        "title": "1. Create Bookings Implementation",
        "content": "The booking creation functionality is implemented in the **handle_booking_with_agno** function. This function uses the Agno agent with **SQLTools** to interact with the PostgreSQL database.\n\n**Key Components:**\n- Uses SQLTools to execute SQL queries against the database\n- Validates service existence, checks time slot availability, and creates bookings\n- Handles both direct booking requests and conversational booking flows\n- Includes error handling and API key rotation for reliability\n\n<div style=\"background-color: #e6ffe6; border-left: 5px solid #28a745; padding: 10px;\">\n  <div style=\"background-color: #ffffff; padding: 10px; margin-bottom: 10px;\">\n    <b style=\"color: blue;\">User:</b> I want to make a booking for May 21 11:00 AM for Glowing Facial<br>\n  </div>\n  <div style=\"background-color: #ffffff; padding: 10px;\">\n    <b style=\"color: purple;\">Bot:</b> Your booking for Glowing Facial on May 21 has been confirmed for Rs.1200\n  </div>\n</div>\n\n**Implementation Details:**\n- The function extracts service, date, and time entities from the user message\n- It queries the services table to get the service ID and price\n- It checks if the requested time slot is available\n- It creates a new booking record in the database\n- It returns a confirmation message with the booking details and price"
      },
      {
        "title": "2. Get Bookings Implementation",
        "content": "The booking retrieval functionality is implemented in the **handle_booking_query_with_agno** function. This function uses the Agno agent with **SQLTools** to query the database for booking information.\n\n**Key Components:**\n- Uses SQLTools to execute SQL queries against the database\n- Supports filtering by previous, future, or all bookings\n- Formats booking information in a user-friendly way\n- Includes reminders about cancellation policies for upcoming bookings\n\n<div style=\"background-color: #e6ffe6; border-left: 5px solid #28a745; padding: 10px;\">\n  <div style=\"background-color: #ffffff; padding: 10px; margin-bottom: 10px;\">\n    <b style=\"color: blue;\">User:</b> What bookings do I have coming up?<br>\n  </div>\n  <div style=\"background-color: #ffffff; padding: 10px;\">\n    <b style=\"color: purple;\">Bot:</b> Here's a summary of your upcoming bookings:<br>\n    Booking ID: 57<br>\n    Service Name: Glowing Facial<br>\n    Booking Date: 2025-05-01<br>\n    Time Slot: 17:00:00<br>\n    Price (INR): 1800.0<br><br>\n    Booking ID: 58<br>\n    Service Name: Deep Tissue Massage<br>\n    Booking Date: 2025-05-02<br>\n    Time Slot: 12:00:00<br>\n    Price (INR): 3000.0<br><br>\n    <b style=\"color: purple;\">Cancellation Policy Reminder:</b> Please remember that cancellations must be made at least 24 hours prior to your appointment to avoid a cancellation fee.\n  </div>\n</div>\n\n**Implementation Details:**\n- The function determines the type of booking query (previous, future, or all)\n- It constructs an SQL query to join the bookings and services tables\n- It filters bookings by the user's ID (used as Customer Name)\n- It applies date filters based on the query type\n- It formats the results into a readable summary with relevant policy reminders"
      },
      {
        "title": "3. Get Services Implementation",
        "content": "The service information functionality is implemented in the **get_services_from_db** function and used within the **handle_general_query_with_agno** function to respond to service-related queries.\n\n**Key Components:**\n- Retrieves service information from the PostgreSQL database\n- Returns service details including name, description, price, and category\n- Used by the general query handler to answer service-related questions\n\n<div style=\"background-color: #e6ffe6; border-left: 5px solid #28a745; padding: 10px;\">\n  <div style=\"background-color: #ffffff; padding: 10px; margin-bottom: 10px;\">\n    <b style=\"color: blue;\">User:</b> What services do you offer?<br>\n  </div>\n  <div style=\"background-color: #ffffff; padding: 10px;\">\n    <b style=\"color: purple;\">Bot:</b> We offer a variety of spa services including:<br><br>\n    1. Massages:<br>\n      - Deep Tissue Massage (Rs.3000): A therapeutic massage that focuses on realigning deeper layers of muscles.<br>\n      - Swedish Massage (Rs.2500): A gentle full-body massage ideal for relaxation and stress relief.<br><br>\n    2. Facials:<br>\n      - Glowing Facial (Rs.1800): Revitalizes your skin for a natural glow.<br>\n      - Anti-Aging Facial (Rs.2200): Reduces fine lines and improves skin elasticity.<br><br>\n   *Additional services listed...*Would you like more information about any specific service?\n  </div>\n</div>\n\n**Implementation Details:**\n- The get_services_from_db function connects to the database and retrieves all services\n- It formats the service data into a structured format with id, name, description, price, and category\n- The general query handler uses this data to answer questions about services\n- Services are typically grouped by category in the response"
      },
      {
        "title": "4. WebSearch using Serper Implementation",
        "content": "The web search functionality is implemented within the **handle_general_query_with_agno** function using **Serper API** for Google search.\n\n**Key Components:**\n- Uses the **Serper API** to perform web searches\n- Enhances search queries with context from previous messages\n- Formats search results for the Agno agent to use in responses\n- Handles errors and API key validation\n\n<div style=\"background-color: #e6ffe6; border-left: 5px solid #28a745; padding: 10px;\">\n  <div style=\"background-color: #ffffff; padding: 10px; margin-bottom: 10px;\">\n    <b style=\"color: blue;\">User:</b> Can people with oily skin go for deep tissue massage?<br>\n  </div>\n  <div style=\"background-color: #ffffff; padding: 10px;\">\n    <b style=\"color: purple;\">Bot:</b> Regarding the deep tissue massage, I am unable to definitively answer whether it is suitable for people with oily skin based on the available information. To determine the best massage type for your skin type, I recommend scheduling a consultation with one of our spa therapists. They can assess your skin and recommend the most appropriate treatment. You can book a consultation by calling us or visiting our website.\n  </div>\n</div>\n\n**Implementation Details:**\n- The function detects when database information is insufficient to answer a question\n- It extracts a search query from the agent's response\n- It enhances the query with context from previous messages\n- It calls the **Serper API** to perform a web search\n- It formats the search results and sends them back to the agent\n- The agent incorporates the search results into its final response\n\nThese tools are integrated into the main conversation flow and are triggered based on user intents and message content. The system uses natural language processing to detect when to use each tool and routes the request accordingly."
      }
    ]
  }